{
  "architectures": [
    "DFlashDraftModel"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "auto_map": {
    "AutoModel": "dflash.DFlashDraftModel"
  },
  "dflash_config": {
    "mask_token_id": 100279,
    "target_layer_ids": [
      6,
      13,
      20,
      27,
      34,
      41
    ],
    "block_size": 16
  },
  "dtype": "bfloat16",
  "eos_token_id": 1,
  "head_dim": 128,
  "hidden_act": "silu",
  "hidden_size": 4096,
  "initializer_range": 0.02,
  "intermediate_size": 11008,
  "layer_types": [
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention"
  ],
  "max_position_embeddings": 131072,
  "max_window_layers": 4,
  "model_type": "qwen3",
  "num_attention_heads": 32,
  "num_hidden_layers": 4,
  "num_key_value_heads": 8,
  "num_target_layers": 43,
  "pad_token_id": 1,
  "rms_norm_eps": 1e-06,
  "rope_scaling": null,
  "rope_theta": 10000000.0,
  "sliding_window": null,
  "tie_word_embeddings": true,
  "use_cache": true,
  "use_sliding_window": false,
  "vocab_size": 129280
}
